app/controllers/discusses_controller.rb

	def index
		@problem = Problem.find(params[:problem_id])
---
SELECT "problems".* FROM "problems" WHERE "problems"."id" = ? LIMIT 1  [["id", "1"]]

	def show
		@problem = Problem.find(params[:problem_id])
		@discuss = @problem.discusses.find(params[:id])
---
SELECT "problems".* FROM "problems" WHERE "problems"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "discusses".* FROM "discusses" WHERE "discusses"."problem_id" = 2 AND "discusses"."id" = ? LIMIT 1  [["id", "1"]]

	def edit
		@problem = Problem.find(params[:problem_id])
		@discuss = @problem.discusses.find(params[:id])
---
SELECT "problems".* FROM "problems" WHERE "problems"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "discusses".* FROM "discusses" WHERE "discusses"."problem_id" = 2 AND "discusses"."id" = ? LIMIT 1  [["id", "5"]]

	def new
	  	@problem = Problem.find(params[:problem_id])
---
SELECT "problems".* FROM "problems" WHERE "problems"."id" = ? LIMIT 1  [["id", "2"]]

	def create
		@problem = Problem.find(params[:problem_id])
		@discuss = @problem.discusses.create(params[:discuss])
---
SELECT "problems".* FROM "problems" WHERE "problems"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "discusses" ("content", "created_at", "problem_id", "updated_at", "user") VALUES (?, ?, ?, ?, ?)  [["content", "3"], ["created_at", Tue, 28 Oct 2014 07:43:56 UTC +00:00], ["problem_id", 1], ["updated_at", Tue, 28 Oct 2014 07:43:56 UTC +00:00], ["user", "3"]]

	def destroy
    	@problem = Problem.find(params[:problem_id])
    	@discuss = @problem.discusses.find(params[:id])
    	@discuss.destroy
---
SELECT "problems".* FROM "problems" WHERE "problems"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "discusses".* FROM "discusses" WHERE "discusses"."problem_id" = 1 AND "discusses"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "discusses" WHERE "discusses"."id" = ?  [["id", 1]]