app/controllers/problems_controller.rb

  def index
    @problems = Problem.search(params[:kwd]).paginate :page => params[:page], :per_page => 10
---
SELECT "problems".* FROM "problems" WHERE (name Like '%1%')
SELECT COUNT(*) FROM "problems"

  def show
    @problem = Problem.find(params[:id])
---
SELECT "problems".* FROM "problems" WHERE "problems"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @problem = Problem.new(params[:problem])

    respond_to do |format|
      if @problem.save
---
INSERT INTO "problems" ("content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Input A and B, Output A + B."], ["created_at", Tue, 28 Oct 2014 06:11:44 UTC +00:00], ["title", "A+B Problem"], ["updated_at", Tue, 28 Oct 2014 06:11:44 UTC +00:00]]