app/controllers/problems_controller.rb

SELECT "problems".* FROM "problems" WHERE "problems"."id" = ? LIMIT 1  [["id", 1]]
---
  def index
    @problems = Problem.search(params[:search])
    @tot = Problem.all.count
    @tot = (@tot - 1) / 3 + 1
    x = params[:id]
    if x
      @problems = []
      x = params[:id].to_i
      t = Problem.all.count
      i = 1
      problem_numbers = -3 * (x - 1)
      while t > 0 do
        if Problem.exists?(i)
          problem_numbers += 1
          t -= 1
          if problem_numbers > 0
            @problems = @problems + [Problem.find(i)]